In [1]:
import pandas as pd

# Quarter 1:

In [2]:
db1b_1=pd.read_csv('DB1B_MARKET_2017_Q1.csv',usecols=['YEAR','QUARTER','ORIGIN','DEST','TICKET_CARRIER','PASSENGERS','MARKET_MILES_FLOWN'])

In [3]:
db1b_1.head()

   YEAR  QUARTER ORIGIN DEST TICKET_CARRIER  PASSENGERS  MARKET_MILES_FLOWN
0  2017        1    ABE  DTW             DL         1.0               425.0
1  2017        1    ABE  DTW             DL         1.0               425.0
2  2017        1    ABE  DTW             DL         1.0               425.0
3  2017        1    ABE  DTW             DL         1.0               425.0
4  2017        1    DTW  ABE             DL         1.0               425.0

In [4]:
db1b_filtered_1=db1b_1.loc[db1b_1["PASSENGERS"]>=40]

In [7]:
db1b_q1=db1b_filtered_1.groupby(['YEAR','QUARTER','ORIGIN','DEST','TICKET_CARRIER','MARKET_MILES_FLOWN']).agg({'PASSENGERS':sum}).reset_index()

In [8]:
db1b_q1.head()

   YEAR  QUARTER ORIGIN DEST TICKET_CARRIER  MARKET_MILES_FLOWN  PASSENGERS
0  2017        1    ABQ  DAL             WN               580.0       604.0
1  2017        1    ABQ  DEN             WN               349.0       187.0
2  2017        1    ABQ  LAS             WN               486.0       601.0
3  2017        1    ABQ  LAX             WN               677.0       406.0
4  2017        1    ABQ  OAK             WN               889.0       187.0

# Quarter 4:

In [ ]:
db1b_4=pd.read+csv('DB1B_MARKET_2017_Q4.csv',usecols=[''])